# -*- coding: utf-8 -*-
import os

bookNameList = '''十三经注疏_01_周易正義  十三经注疏_05_儀禮注疏        十三经注疏_09_春秋穀梁傳注疏  十三经注疏_13_孝經注疏   十三经注疏_02_尚書正義  十三经注疏_06_禮記正義        十三经注疏_10_論語注疏  十三经注疏_03_毛詩正義  十三经注疏_07_春秋左傳正義    十三经注疏_11_爾雅注疏    十三经注疏_04_周禮注疏  十三经注疏_08_春秋公羊傳注疏  十三经注疏_12_孟子注疏 '''

bookNameList = bookNameList.split()
bookNameList.sort()

for bookName in bookNameList:
    print '"' + bookName + '": (, []),'
    
bookIndexData = {
    "十三经注疏_01_周易正義": (37, [1, 50, 104, 163, 211, 263, 301, 346, 380, 402, 452]),
    "十三经注疏_02_尚書正義": (30, [1, 22, 59, 102, 134, 158, 206, 226, 265, 292, 317, 351, 386, 422, 459, 497, 532, 566, 608, 653, 674]),
    "十三经注疏_03_毛詩正義": (55, [1, 128, 212, 293, 379, 439, 510, 564, 630, 714, 772, 814, 904, 973, 1046, 1114, 1239, 1356, 1494, 1622, 1727]),
    "十三经注疏_04_周禮注疏": (46,
            [1, 28, 63, 94, 127, 163, 196, 230, 263, 284,
             323, 348, 379, 409, 443, 477, 509, 529, 573, 606,
             640, 667, 701, 733, 767, 799, 837, 872, 892, 924,
             957, 983, 1009, 1042, 1070, 1107, 1147, 1192, 1235, 1272,
             1311, 1355, 1392]),
    "十三经注疏_05_儀禮注疏": (31,
            [1, 22, 47, 68, 87, 106, 126, 145, 160, 180,
             199, 225, 258, 286, 309, 341, 358, 385, 412, 435,
             456, 478, 497, 518, 549, 575, 599, 621, 639, 651,
             674, 698, 716, 738, 759, 782, 806, 834, 859, 877,
             894, 918, 945, 967, 986, 1011, 1036, 1055, 1077, 1106,
             1134]),
    "十三经注疏_06_禮記正義": (39,
            [1, 40, 85, 119, 156, 194, 226, 258, 296, 340,
             386, 431, 471, 512, 550, 582, 622, 661, 694, 725,
             766, 799, 835, 868, 892, 926, 965, 989, 1016, 1048,
             1084, 1113, 1135, 1162, 1181, 1224, 1250, 1281, 1308, 1342,
             1364, 1392, 1415, 1438, 1471, 1506, 1528, 1551, 1570, 1597,
             1626, 1661, 1689, 1713, 1750, 1775, 1797, 1816, 1841, 1859,
             1883, 1913, 1938, 1959]),
    "十三经注疏_07_春秋左傳正義": (36,
            [1, 37, 78, 116, 151, 179, 212, 246, 277, 314,
             345, 364, 398, 426, 460, 488, 528, 554, 581, 647,
             673, 703, 727, 758, 785, 817, 855, 886, 932, 966,
             1008, 1041, 1075, 1096, 1123, 1160, 1184, 1208, 1248, 1277,
             1307, 1348, 1392, 1421, 1456, 1508, 1536, 1563, 1596, 1624,
             1658, 1687, 1726, 1761, 1795, 1826, 1851, 1881, 1915, 1944,
             1982, 1987]),
    "十三经注疏_08_春秋公羊傳注疏": (33,
            [1,  35, 55, 78, 104, 130, 156, 183, 207, 232,
             257, 287, 319, 344, 369, 399, 426, 454, 475, 500,
             522, 543, 571, 593, 625, 651, 678, 701, 723]),
    "十三经注疏_09_春秋穀梁傳注疏": (38,
            [1, 20, 37, 54, 71, 97, 123, 140, 160, 181,
             198, 215, 241, 258, 278, 297, 316, 337, 356, 379,
             401]),
    "十三经注疏_10_論語注疏": (31,
            [1, 15, 30, 51, 59, 77, 93, 111, 124, 139,
             159, 177, 192, 206, 234, 250, 264, 280, 291, 302,
             309]),
    "十三经注疏_11_爾雅注疏": (30,
            [1, 27, 63, 104, 137, 178, 209, 256, 297, 340,
             387]),
    "十三经注疏_12_孟子注疏": (38,
            [1, 37, 81, 121, 152, 189, 218, 251, 285, 315,
             345, 375, 410, 446, 483]),
    "十三经注疏_13_孝經注疏": (45,
            [1, 10, 19, 27, 33, 45, 53, 60, 67, 73]),
}

for bookName in bookNameList:
    # generate png images
    pdfToPpmCmdText = 'pdftoppm -png -r 300 ' + bookName + '/' + bookName + '_div4_raw.pdf ' + bookName + '/' + bookName + '_div4'
    print pdfToPpmCmdText
    os.system(pdfToPpmCmdText)
    rawPageData = bookIndexData[bookName]
    chapterInQuarterPages = []
    chapterInQuarterPages.append(rawPageData[0]*4)
    for i in range(1, len(rawPageData[1])):
        chapterInQuarterPages.append((rawPageData[1][i]-rawPageData[1][i-1])*4)
    print chapterInQuarterPages
    # list chapter pngs
    for i in range(0, len(chapterInQuarterPages)):
        print "chapter " + str(i)
        offset = sum(chapterInQuarterPages[0:i])
        for k in range(offset+1, offset+1 + chapterInQuarterPages[i]):
            digitWidth = 4
            if bookName == "十三经注疏_13_孝經注疏":
                digitWidth = 3
            sourcePng = bookName + '/' + bookName + "_div4-" + str(k).zfill(digitWidth) + ".png"
            targetPng = bookName + "_div4-tmp-" + str(k).zfill(digitWidth) + ".png"
            cpCmdText = 'cp ' + sourcePng + ' ' + targetPng
            print cpCmdText
            os.system(cpCmdText)
        cvtCmdText = 'convert *_div4-tmp-*.png ' + bookName + '_volume_' + str(i).zfill(2) + '.pdf'
        print cvtCmdText
        os.system(cvtCmdText)
        rmCmdText = 'rm -f *_div4-tmp-*'
        print rmCmdText
        os.system(rmCmdText)
